{"config": [{"config": {"nb_row": 3, "b_constraint": null, "activation": "relu", "name": "convolution2d_1", "batch_input_shape": [null, 3, 32, 32], "W_constraint": null, "init": "glorot_uniform", "subsample": [1, 1], "trainable": true, "nb_col": 3, "input_dtype": "float32", "W_regularizer": null, "activity_regularizer": null, "nb_filter": 16, "border_mode": "valid", "bias": true, "dim_ordering": "th", "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"nb_row": 3, "b_constraint": null, "activation": "relu", "name": "convolution2d_2", "W_constraint": null, "init": "glorot_uniform", "subsample": [1, 1], "trainable": true, "bias": true, "W_regularizer": null, "nb_col": 3, "nb_filter": 32, "activity_regularizer": null, "border_mode": "valid", "dim_ordering": "th", "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"strides": [2, 2], "border_mode": "valid", "name": "maxpooling2d_1", "pool_size": [2, 2], "trainable": true, "dim_ordering": "th"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"b_constraint": null, "activation": "relu", "name": "dense_1", "W_constraint": {"axis": 0, "m": 3, "name": "MaxNorm"}, "trainable": true, "W_regularizer": null, "output_dim": 256, "input_dim": null, "bias": true, "activity_regularizer": null, "init": "glorot_uniform", "b_regularizer": null}, "class_name": "Dense"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"b_constraint": null, "activation": "softmax", "name": "dense_2", "W_constraint": null, "trainable": true, "W_regularizer": null, "output_dim": 10, "input_dim": null, "bias": true, "activity_regularizer": null, "init": "glorot_uniform", "b_regularizer": null}, "class_name": "Dense"}], "keras_version": "1.1.2", "class_name": "Sequential"}